socialNetwork/logs/containers1_1250r_100c_t8_d1m_rr.txt
Running 1m test @ http://localhost:8080/wrk2-api/user/register
  8 threads and 100 connections

  Thread calibration: mean lat.: 0.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.282ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.281ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.275ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.269ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.272ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user/register 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   275.54us  117.21us 582.00us   91.38%
    Req/Sec   184.69    140.57   600.00     66.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  256.00us
 75.000%  304.00us
 90.000%  375.00us
 99.000%  582.00us
 99.900%  831.00us
 99.990%    4.80ms
 99.999%    8.45ms
100.000%    9.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.116     0.000000            2         1.00
       0.196     0.100000         7206         1.11
       0.214     0.200000        14427         1.25
       0.228     0.300000        21187         1.43
       0.242     0.400000        28320         1.67
       0.256     0.500000        35232         2.00
       0.264     0.550000        38933         2.22
       0.272     0.600000        42293         2.50
       0.281     0.650000        45842         2.86
       0.291     0.700000        49133         3.33
       0.304     0.750000        52629         4.00
       0.312     0.775000        54453         4.44
       0.321     0.800000        56247         5.00
       0.331     0.825000        57956         5.71
       0.343     0.850000        59702         6.67
       0.357     0.875000        61390         8.00
       0.366     0.887500        62322         8.89
       0.375     0.900000        63179        10.00
       0.385     0.912500        64042        11.43
       0.398     0.925000        64906        13.33
       0.411     0.937500        65741        16.00
       0.420     0.943750        66197        17.78
       0.430     0.950000        66620        20.00
       0.442     0.956250        67083        22.86
       0.456     0.962500        67525        26.67
       0.470     0.968750        67927        32.00
       0.480     0.971875        68158        35.56
       0.491     0.975000        68376        40.00
       0.503     0.978125        68587        45.71
       0.518     0.981250        68804        53.33
       0.536     0.984375        69027        64.00
       0.546     0.985938        69138        71.11
       0.558     0.987500        69245        80.00
       0.572     0.989062        69353        91.43
       0.589     0.990625        69465       106.67
       0.611     0.992188        69574       128.00
       0.621     0.992969        69626       142.22
       0.636     0.993750        69682       160.00
       0.652     0.994531        69740       182.86
       0.668     0.995313        69790       213.33
       0.689     0.996094        69849       256.00
       0.699     0.996484        69874       284.44
       0.712     0.996875        69902       320.00
       0.728     0.997266        69927       365.71
       0.743     0.997656        69956       426.67
       0.768     0.998047        69983       512.00
       0.777     0.998242        69995       568.89
       0.788     0.998437        70011       640.00
       0.795     0.998633        70023       731.43
       0.809     0.998828        70036       853.33
       0.833     0.999023        70050      1024.00
       0.855     0.999121        70058      1137.78
       0.881     0.999219        70065      1280.00
       0.896     0.999316        70071      1462.86
       0.921     0.999414        70077      1706.67
       0.974     0.999512        70085      2048.00
       0.981     0.999561        70088      2275.56
       1.013     0.999609        70091      2560.00
       1.032     0.999658        70095      2925.71
       1.063     0.999707        70098      3413.33
       1.129     0.999756        70101      4096.00
       1.233     0.999780        70103      4551.11
       1.531     0.999805        70105      5120.00
       1.807     0.999829        70107      5851.43
       2.195     0.999854        70108      6826.67
       2.941     0.999878        70110      8192.00
       4.795     0.999890        70111      9102.22
       6.959     0.999902        70112     10240.00
       7.767     0.999915        70113     11702.86
       7.767     0.999927        70113     13653.33
       7.999     0.999939        70114     16384.00
       8.223     0.999945        70115     18204.44
       8.223     0.999951        70115     20480.00
       8.383     0.999957        70116     23405.71
       8.383     0.999963        70116     27306.67
       8.383     0.999969        70116     32768.00
       8.447     0.999973        70117     36408.89
       8.447     0.999976        70117     40960.00
       8.447     0.999979        70117     46811.43
       8.447     0.999982        70117     54613.33
       8.447     0.999985        70117     65536.00
       9.103     0.999986        70118     72817.78
       9.103     1.000000        70118          inf
#[Mean    =        0.276, StdDeviation   =        0.117]
#[Max     =        9.096, Total count    =        70118]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  84095 requests in 1.00m, 15.96MB read
Requests/sec:   1401.38  
Transfer/sec:    272.34KB