socialNetwork/logs/containers2_1250r_100c_t8_d1m_rr.txt
Running 1m test @ http://localhost:8080/wrk2-api/user/register
  8 threads and 100 connections

  Thread calibration: mean lat.: 0.287ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.288ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.305ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.315ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.300ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.282ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.332ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user/register 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   278.66us   83.53us 579.00us   80.25%
    Req/Sec   184.63    139.37   555.00     66.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  260.00us
 75.000%  308.00us
 90.000%  380.00us
 99.000%  579.00us
 99.900%  790.00us
 99.990%    1.35ms
 99.999%    2.01ms
100.000%    2.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.123     0.000000            1         1.00
       0.200     0.100000         7162         1.11
       0.218     0.200000        14375         1.25
       0.232     0.300000        21217         1.43
       0.246     0.400000        28418         1.67
       0.260     0.500000        35306         2.00
       0.268     0.550000        38944         2.22
       0.276     0.600000        42386         2.50
       0.285     0.650000        45731         2.86
       0.295     0.700000        49123         3.33
       0.308     0.750000        52604         4.00
       0.316     0.775000        54410         4.44
       0.325     0.800000        56166         5.00
       0.335     0.825000        57889         5.71
       0.347     0.850000        59650         6.67
       0.362     0.875000        61421         8.00
       0.370     0.887500        62270         8.89
       0.380     0.900000        63187        10.00
       0.390     0.912500        63999        11.43
       0.403     0.925000        64890        13.33
       0.417     0.937500        65779        16.00
       0.426     0.943750        66208        17.78
       0.436     0.950000        66652        20.00
       0.446     0.956250        67061        22.86
       0.460     0.962500        67515        26.67
       0.476     0.968750        67944        32.00
       0.484     0.971875        68158        35.56
       0.494     0.975000        68379        40.00
       0.506     0.978125        68596        45.71
       0.520     0.981250        68816        53.33
       0.536     0.984375        69024        64.00
       0.546     0.985938        69135        71.11
       0.559     0.987500        69245        80.00
       0.572     0.989062        69356        91.43
       0.583     0.990625        69461       106.67
       0.602     0.992188        69576       128.00
       0.612     0.992969        69627       142.22
       0.622     0.993750        69681       160.00
       0.634     0.994531        69738       182.86
       0.646     0.995313        69793       213.33
       0.665     0.996094        69850       256.00
       0.675     0.996484        69875       284.44
       0.688     0.996875        69899       320.00
       0.702     0.997266        69928       365.71
       0.713     0.997656        69956       426.67
       0.733     0.998047        69982       512.00
       0.741     0.998242        69998       568.89
       0.752     0.998437        70009       640.00
       0.761     0.998633        70023       731.43
       0.778     0.998828        70038       853.33
       0.794     0.999023        70050      1024.00
       0.814     0.999121        70057      1137.78
       0.830     0.999219        70064      1280.00
       0.853     0.999316        70071      1462.86
       0.869     0.999414        70077      1706.67
       0.897     0.999512        70084      2048.00
       0.920     0.999561        70088      2275.56
       0.947     0.999609        70091      2560.00
       0.958     0.999658        70095      2925.71
       1.011     0.999707        70098      3413.33
       1.055     0.999756        70101      4096.00
       1.075     0.999780        70103      4551.11
       1.098     0.999805        70105      5120.00
       1.107     0.999829        70107      5851.43
       1.227     0.999854        70108      6826.67
       1.285     0.999878        70110      8192.00
       1.347     0.999890        70111      9102.22
       1.357     0.999902        70112     10240.00
       1.392     0.999915        70113     11702.86
       1.392     0.999927        70113     13653.33
       1.468     0.999939        70114     16384.00
       1.640     0.999945        70115     18204.44
       1.640     0.999951        70115     20480.00
       1.665     0.999957        70116     23405.71
       1.665     0.999963        70116     27306.67
       1.665     0.999969        70116     32768.00
       2.012     0.999973        70117     36408.89
       2.012     0.999976        70117     40960.00
       2.012     0.999979        70117     46811.43
       2.012     0.999982        70117     54613.33
       2.012     0.999985        70117     65536.00
       2.139     0.999986        70118     72817.78
       2.139     1.000000        70118          inf
#[Mean    =        0.279, StdDeviation   =        0.084]
#[Max     =        2.138, Total count    =        70118]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  84094 requests in 1.00m, 15.96MB read
Requests/sec:   1401.36  
Transfer/sec:    272.33KB